
[
{"name":"Batman",
"rname":"Bruce Wayne",
"cname":"Batman",
"power":"",
"world":"PRIME EARTH",
"icon":"https:\/\/s3.amazonaws.com\/comicgeeks\/characters\/avatars\/2.jpg?t=1647766122",
"bio":"",
"image":""},
{"name":"Superman",
"rname":"Clark Kent",
"cname":"Superman,",
"power":"",
"world":"PRIME EARTH",
"icon":"https://s3.amazonaws.com/comicgeeks/characters/avatars/20.jpg?t=",
"bio":"Kal-El was just a baby when his biological father, Jor-El, a scientist on his home planet of Krypton, sent him away on a capsule due to the core of planet being unstable and doomed. He would crash land in Smallville, Kansas, discovered by Jonathan and Martha Kent, who both took him in as their child.

The Kent family raised Kal-El as their own, donning name of Clark Kent in the process, assuring Clark that he'd be well-protected on Earth. For years, Clark genuinely believed that he was a real human. He looked and acted like one. It was not until his teenage years that Clark began to develop his Kryptonian and metahuman abilities. Jonathan and Martha were forced to tell him the truth, with Clark viewing a holographic message from his biological parents, Jor-El and Lara, about his old home in the solace of Krypton.

Clark would move out of his parents' home into the storied city of Metropolis, where he would work under Perry White's Daily Planet newspaper. He would fall in love with fellow reporter Lois Lane, who would eventually become his wife and one true love. Clark would also meet the clunky photographer Jimmy Olsen. However, as threats began to unleash on the city, he would become Superman.",
"image":""},
{"name":"Joker",
"rname":"",
"cname":"Joker,",
"power":"",
"world":"PRIME EARTH",
"icon":"https://s3.amazonaws.com/comicgeeks/characters/avatars/35.jpg?t=",
"bio":"A complete psychopath with no moral compass whatsoever, The Joker, whose real name and identity remain completely unknown, is characterized by his chalk-white skin, green hair and a permanent rictus grin stretched across his face. But there isn’t a single thing funny about this particular clown, who only finds humor in the suffering of others.

The Joker first appeared in Gotham City around the same time that the Batman arrived on the scene, and since their very first confrontation, the Clown Prince of Crime has been the Dark Knight’s most formidable nemesis. While Batman represents justice and order, The Joker is his complete opposite, seeing himself as an agent of chaos, the living embodiment of the cruel randomness of fate. The Joker’s psychosis causes his personality to shift between goofy prankster and mass murderer on a dime, making it impossible to predict his next move. It’s this unpredictability that really makes him such a dangerous opponent.

Certainly, no villain has managed to inflict as much pain and suffering on Batman as The Joker, who has on more than one occasion brought death to Bruce Wayne’s extended family. As long as there is a Batman bringing justice to Gotham City, there will be a Joker to bring nightmares.",
"image":""}
]


