
[
{"name":"Batman",
"rname":"Bruce Wayne",
"cname":"Batman",
"power":"",
"world":"PRIME EARTH",
"icon":"https:\/\/s3.amazonaws.com\/comicgeeks\/characters\/avatars\/2.jpg?t=1647766122",
"bio":"Young Bruce Wayne was a child of privilege, raised under the watchful eye of his parents, Thomas and Martha, in the upper echelons of Gotham City’s high society. Far removed from the city’s slow descent into corruption and chaos, Bruce enjoyed a carefree childhood with the promise of a bright and easy future, in which his family’s name and fortune would see to it that he would never want for anything.

But fate intervened before that future could ever become a reality. One night, after the Waynes exited a movie theater in one of Gotham’s rougher neighborhoods, they were caught in a mugging that left both Thomas and Martha shot dead before Bruce’s eyes. Suddenly orphaned, Bruce was left in the care of his family’s butler, Alfred Pennyworth, as he fought to survive in a world where the rules as he understood them no longer made sense.

Bruce Wayne swore an oath to rid the city of the evil that had taken his parents' lives. He spent his youth traveling the world, training himself to intellectual and physical perfection and learning a variety of crime-fighting skills, including chemistry, criminology, forensics, martial arts, gymnastics, disguise, and escape artistry.

At age 14, Bruce Wayne began his global sojourn, attending courses at Cambridge, the Sorbonne, Berlin School of Science and other European universities, only taking subjects that suited him and his plan. However, he never stayed long and would often drop out after one semester. While abroad, he studied and received training in multiple martial art styles from various instructors in different countries. He learnt man-hunting from Frenchman Henri Ducard, stealth and reconnaissance under the Japanese ninja Kirigi and other certified shinobi, hunting under the African Bushman (the Ghost Tribes of the Ten-Eyed Brotherhood, among others), hand-to hand combat under the tutelage of Ted Grant, a world-champion boxer and David Cain, one of the world's premier assassins; traditional healing disciplines under Nepalese monks and even ventriloquism under skilled practitioners. Bruce also trained with Chu Chin Li and Tsunemoto in martial arts. He was trained in kung fu by Richard Dragon. He was also trained in archery by Oliver Queen. At the age of 17, Bruce was trained by detective Harvey Harris to improve his detective skills. At age 20, he attempted to join the FBI, but after learning about its regulations and conduct, Wayne deducted that he would never be able to completely oppose crime while working within the legal system. The final mentor Bruce trained with was bounty hunter Willis Doggett, when Bruce and Willie were tracking a target, Willie was killed and Bruce managed to fight off the target by throwing him over a cliff, along with his parka. Luckily Bruce was rescued by a shaman and survived. After this, Bruce returned to Gotham after twelve years of training at the age of 25.

Bruce Wayne returned to Gotham City after many years of study and training with his body and mind developed to perfection. Despite having all of the skills and methods to fight crime, he still felt that there was something missing in the completion of his physical and mental arsenal. Wayne discovered the answer late one night while sitting in his manor. He recalled his fear of bats as a child after a large one crashed through one of the windows; he ultimately decided to make his appearance resemble a bat's. Wayne designed himself a costume equipped with experimental technology and set out against the crime and corruption that thrived in Gotham City.

Wayne's tactics to oppose crime as a vigilante at night proved successful leading him to become an urban legend in Gotham City. He revealed himself at a dinner of the most influential and corrupt figures in Gotham City and promised them all that their reigns on the city would eventually end. Wayne's first ally was assistant district attorney Harvey Dent. Most of the Gotham City Police Department was sent in force to capture him. He gained his most powerful ally when he met police lieutenant James Gordon, one of the few honest cops on the force. The two developed a working relationship operating outside of the law when they needed to.

Batman's presence in Gotham City generated a new breed of criminals, no longer the simple thugs and gangsters involved in Gotham Organized Crime, but more dynamic personalities. The first person inspired by him was Catwoman, a dangerous seductress using his style and methods towards her own ends. His next challenge was Dr. Hugo Strange, a mad scientist who had created Monster Men to do his bidding. He met his greatest nemesis when the Joker first appeared, a brilliant serial killer dressing like a clown and murdering people uncontrollably. He had been exposed to chemicals in an accident that drove him completely insane, and he swore revenge on Gotham for creating him. This confrontation led to the creation of the Bat-Signal, a giant spotlight displayed in the sky whenever there is danger and Batman is needed. There would be many more villains starting to appear within this time. The Scarecrow was an outcast who developed techniques to strike terror into the hearts of his victims for his own pleasure. The Riddler was another deranged genius who felt a psychological compulsion to demonstrate his intellectual superiority, and constructed elaborate crimes while delivering clues daring law enforcement to catch him. Poison Ivy attempted to destroy the city when an advanced connection to plant-life led her to wage a personal war against humanity. The psychotic Mister Freeze used dangerous experimental technology to take revenge against society when his wife died. Another crime boss appeared named the Penguin who acted as an eccentric criminal mastermind without any crippling mental illness other than a desire to prove himself. Many of these villains were kept in Arkham Asylum for the criminally insane.

Bruce Wayne was on an excursion to the circus when he witnessed another tragedy that would shape his life. The parents of a young acrobat named Dick Grayson were murdered by the gangster Tony Zucco. He saw both great potential and something of himself in the boy that night. Although Bruce knew he could never replace Dick's father, he adopted Grayson as his legal ward to help him and provide guidance where he didn't have any when he was that age. He eventually revealed his secret identity as Batman. Dick wanted justice for his parents, and he agreed to a regiment of rigorous physical and mental training so that he could become Batman's partner. After several months Dick was finally ready to take to the streets as Robin, fighting crime alongside his mentor. They swore an oath late one night that they would fight together against crime and corruption, never swerving from the path of righteousness. Batman had realized for the first time that he did not have to be alone in his crusade.

When Bruce was invited to the Million Dollar Masquerade Ball, Commissioner Gordon's daughter, Barbara crashed the party in a female version of Batman's costume to surprise her father, who was also attending the event. At the party, before she revealed herself to Gordon, Killer Moth and his henchmen crashed the party, gunning for Bruce Wayne. James Gordon was taken out quickly so Barbara decided to step in. Bruce Wayne was previously shoved out of the way by Barbara so that she could protect him and her unconscious adoptive father, thinking that Bruce was but a helpless bystander. She defeated Killer Moth, breaking a heel in the process. She was later named Batgirl by Killer Moth, which stuck, even though she stated that she would have preferred Batwoman. Directly after the confrontation with Killer Moth, Batgirl met Batman and Robin. Batgirl's first encounter with Batman and Robin proved to be unpleasant. While she was angry with Batman's automatic dismissal of her capabilities, she was repulsed by Robin having a romantic interest in her. Soon after that, Batgirl attempted to swing from rooftops, being saved by Robin, who told her that regular rope is not good for diving from forty feet in the air. Later, Robin sent Batgirl equipment, pretending that he believed in her and Batman didn't. In reality, Robin was sending them on the orders of Batman. She was later captured by Batman and Robin to be tested, an examination she failed in Batman's eyes, not being able to save the innocents in a holographic containment chamber. Batgirl later teamed up with Black Canary, her idol, and she finally gained some respect from Batman, while Robin still harbored a crush on her. She was introduced to James Gordon as Batgirl, one of Batman's protégés.

When Dick Grayson reached maturity, Bruce forced him to retire from the Robin persona. Shortly after this decision, Batman came across a young boy called Jason Todd, who had turned to crime out of necessity. Batman tried to help him by placing him at Ma Gunn's school, which was in fact a criminal hideout. Investigating Jason's background, Batman learned that the boy was an orphan. When Batman checked upon Jason, he realized the truth about the school and stopped the criminals with help from Jason, after which Batman took him under his wing and allowed him to become his new Robin.

Over time, Batman realized Jason was behaving more aggressive towards criminals and this violence wound up being the cause of the death of a criminal. When Jason became an inconvenience while fighting crime, Batman restricted him from going out as Robin. In the meantime, Joker had escaped from Arkham and Batman followed the trail of the madman to the Middle East, where he also found Jason. Batman learned that Jason was looking for his real mother and when their missions crossed, they worked together to foil Joker's plans. Although they couldn't capture the Joker, Jason was reunited with his mother, Sheila Haywood. Unfortunately, she was being blackmailed by the Joker and the Dynamic Duo had to separate to deal with a double threat by the madman. While Batman went on to stop a deadly cargo of Joker Venom, Robin tried to save his mother, but he was captured and beaten by the Joker. By the time Batman arrived at the crime scene, the warehouse where Jason and his mother were locked exploded and Batman couldn't save either of them.

Following the death of Jason Todd, Batman became much more violent and aggressive while coping with the tragedy without someone to balance him out. A young man named Tim Drake figured out his secret identity using detective work, and determined that he needed a Robin to keep his darkness in check, just as Two-Face reappeared with new plans to kill the Dark Knight. Drake begged Dick Grayson to go back to his identity as Robin again when he was needed most. After explaining that he had deduced their identities by following Grayson's acrobatic career to Dick and Alfred Pennyworth, Tim was taken into the Batcave where it was suggested that he become the new Robin. Batman and Nightwing tracked down Two-Face, and he caught them in his underground death-trap. Tim took the Robin costume to rescue them and succeeded, although Batman argued that he no longer needed a side-kick. Begrudgingly, as he proved himself and helped them defeat Two-Face, Bruce agreed to start training Tim Drake and take him on as his new crime-fighting partner.

Having virtually eliminated all super-crime in Gotham with the energy from his recent vacation, Bruce went abroad. Alfred explained that he had become so consumed by Batman he forgot how to act as Bruce Wayne, and needed to relearn. At a charity function in London he met Jezebel Jet, an intelligent fashion model and ruler of an impoverished African nation whom he falls in love with immediately. The League of Assassins attacked Batman using a legion of ninjas transformed into Man-Bats by a serum stolen from Kirk Langstrom. Talia al Ghul took him prisoner and revealed that they had a son together she never told him about, introducing him to Damian Wayne. Bruce needed to take care of the child and teach him respect while he figured out Talia's plans, as Damian proved to be spoiled and petulant. Raised by the League, he was a master martial artist and proved extremely difficult to control, beating up Tim Drake and beheading the Spook to prove he could be Robin. Batman agreed to let Damian fight at his side rather than leave him alone, with the understanding that he would follow their no killing rules and obey orders. Talia was in Gibraltar, and they took the Bat-Rocket to get there before she could follow through with her terrorist attack. This turned out to have been an elaborate ploy to bring them together as a family, in the hopes that Bruce would return to her so they could put an end to all crime by ruling the planet together. Batman refused, so she declared war on him and they both disappeared during an explosion.

Batman had to solve the murder of a New God when Orion was killed in Metropolis by a Radion Bullet. This was part of a greater plot by Darkseid to control the Multiverse using the Anti-Life Equation during Final Crisis. He was laterally displaced in time due to Darkseid's Omega Beams. His first Robin, Dick Grayson, would eventually take his place as the Batman. He later returned and started Batman Incorporated, an international fighting force of Batmen.",
"image":""},
{"name":"Superman",
"rname":"Clark Kent",
"cname":"Superman,",
"power":"",
"world":"PRIME EARTH",
"icon":"https://s3.amazonaws.com/comicgeeks/characters/avatars/20.jpg?t=",
"bio":"Kal-El was just a baby when his biological father, Jor-El, a scientist on his home planet of Krypton, sent him away on a capsule due to the core of planet being unstable and doomed. He would crash land in Smallville, Kansas, discovered by Jonathan and Martha Kent, who both took him in as their child.

The Kent family raised Kal-El as their own, donning name of Clark Kent in the process, assuring Clark that he'd be well-protected on Earth. For years, Clark genuinely believed that he was a real human. He looked and acted like one. It was not until his teenage years that Clark began to develop his Kryptonian and metahuman abilities. Jonathan and Martha were forced to tell him the truth, with Clark viewing a holographic message from his biological parents, Jor-El and Lara, about his old home in the solace of Krypton.

Clark would move out of his parents' home into the storied city of Metropolis, where he would work under Perry White's Daily Planet newspaper. He would fall in love with fellow reporter Lois Lane, who would eventually become his wife and one true love. Clark would also meet the clunky photographer Jimmy Olsen. However, as threats began to unleash on the city, he would become Superman.",
"image":""},
{"name":"Joker",
"rname":"",
"cname":"Joker,",
"power":"",
"world":"PRIME EARTH",
"icon":"https://s3.amazonaws.com/comicgeeks/characters/avatars/35.jpg?t=",
"bio":"A complete psychopath with no moral compass whatsoever, The Joker, whose real name and identity remain completely unknown, is characterized by his chalk-white skin, green hair and a permanent rictus grin stretched across his face. But there isn’t a single thing funny about this particular clown, who only finds humor in the suffering of others.

The Joker first appeared in Gotham City around the same time that the Batman arrived on the scene, and since their very first confrontation, the Clown Prince of Crime has been the Dark Knight’s most formidable nemesis. While Batman represents justice and order, The Joker is his complete opposite, seeing himself as an agent of chaos, the living embodiment of the cruel randomness of fate. The Joker’s psychosis causes his personality to shift between goofy prankster and mass murderer on a dime, making it impossible to predict his next move. It’s this unpredictability that really makes him such a dangerous opponent.

Certainly, no villain has managed to inflict as much pain and suffering on Batman as The Joker, who has on more than one occasion brought death to Bruce Wayne’s extended family. As long as there is a Batman bringing justice to Gotham City, there will be a Joker to bring nightmares.",
"image":""},
{"name":"Harley Quinn",
"rname":"Harleen Quinzel",
"cname":"Harley Quinn,",
"power":"",
"world":"PRIME EARTH",
"icon":"https://s3.amazonaws.com/comicgeeks/characters/avatars/medium-41207.jpg?t=",
"bio":"",
"image":""}
]


