
[
{
"name":"Sins of Sinister",
"summary":"This universe-melting X-event will introduce a horrifying timeline that makes the Age of Apocalypse look like the X-Men Swimsuit Special as Mister Sinister’s repulsive plans come to fruition. Currently playing a dangerous game with the very timestream of the Marvel Universe, Sinister’s uncontrollable lust for domination will finally be satisfied, but at what cost? It's the end of the world as we know it, but at least Sinister feels fine. For now. Can that last? Especially when we discover that he really is his own worst enemy...with a giant one-shot to kick it off written by KIERON GILLEN and finished by LUCAS WERNECK.",
"text":"#FFFFFF",
"body":"#C41E3A",
"info":"Please Share The FlickVine App With Friends And Family",
"image":"https://anusiugochukwu.github.io/vines/timeline/sinsofsinister(p).jpg",
"banner":"https://anusiugochukwu.github.io/vines/timeline/sinsofsinister.jpg",
"page":"sinsofsinister(2023).html"
},
{
"name":"Lazarus Planet",
"summary":"CHANGE THE WORLD. Following the explosive (literally) events of Batman vs. Robin #4, the Lazarus Volcano has erupted, spewing dangerous and transformative chemicals into Earth's atmosphere! As these Lazarus clouds rain down upon the planet, people across the globe begin to develop strange new abilities, watch their already-extraordinary abilities change, and witness a whole host of chaos unlike anything the DCU has experienced before! It's up to Damian Wayne to put out the distress call for whoever can still hear it: come to the ruins of the Hall of Justice and help save the world! Poison Ivy, Power Girl, Cyborg, Batman, and more answer the call...but why could the fate of all life as we know it rest in the hands of...Monkey Prince?",
"text":"#76A65E",
"body":"#000000",
"info":"",
"logo":"https://anusiugochukwu.github.io/vines/timeline/lazarus planet(l).png",
"image":"https://anusiugochukwu.github.io/vines/timeline/lazarus planet(p).jpg",
"banner":"https://anusiugochukwu.github.io/vines/timeline/lazarus planet.jpg",
"page":"lazarusplanet(2023).html"
},
{
"name":"Dark Web",
"summary":"The two most famous clones ever are back to take what’s theirs. Ben Reilly and Madelyne Pryor have had enough and are reigniting the INFERNO! Spider-Man and the X-Men are not ready for what’s coming, and what role does Venom have in all of this? The sun is setting, dusk is approaching, and it’s going to be a long night.",
"text":"#D50000",
"body":"#000000",
"info":"",
"logo":"https://anusiugochukwu.github.io/vines/timeline/sins of sinister(l).png",
"image":"https://anusiugochukwu.github.io/vines/timeline/darkweb(p).jpg",
"banner":"https://anusiugochukwu.github.io/vines/timeline/darkweb.jpg",
"page":"darkweb(2022).html"
},
{
"name":"Judgment Day",
"summary":"IN THE LAND OF THE RIGHTEOUS...The X-Men claim they’re the planets’ new gods. The Eternals know that position is already filled. The Avengers are about to realize exactly how many secrets their so-called friends have kept from them. Years of tension lead to a volcanic eruption as two worlds burn. Who has leaked the X-Men’s secrets to their latest foes? Why is Tony Stark abducting an old friend? And who stands in judgment over the whole world? Judgment Day from Kieron Gillen and Valerio Schiti is the apocalyptic emotional event to define the summer.",
"text":"#D50000",
"body":"#000000",
"info":"",
"logo":"https://anusiugochukwu.github.io/vines/timeline/sins of sinister(l).png",
"image":"https://anusiugochukwu.github.io/vines/timeline/axe(p).jpg",
"banner":"https://anusiugochukwu.github.io/vines/timeline/judgment day.jpg",
"page":"judgmentday(2022).html"
},
{
"name":"Dark Crisis",
"summary":"Crisis on Infinite Earths. Infinite Crisis. Final Crisis. And now…Dark Crisis!

The epic event years in the making is finally here! Superman, Batman, Wonder Woman, and the rest of the Justice League are dead. The remaining heroes are left to protect the world from an onslaught of violent attacks by DC’s greatest villains! Can the legacy heroes step out of the shadows of the classic heroes to form a new Justice League? And will that be enough to stop a darkness greater than anything they’ve ever faced from destroying everything?",
"text":"#C2FBFC",
"body":"#000000",
"info":"",
"logo":"https://anusiugochukwu.github.io/vines/timeline/sins of sinister(l).png",
"image":"https://anusiugochukwu.github.io/vines/timeline/darkcrisis(p).jpg",
"banner":"https://anusiugochukwu.github.io/vines/timeline/dark crisis.jpg",
"page":"darkcrisis(2022).html"
}
]
